{
    "source": "https://www.saferecipeguide.org/sample-recipe/",
    "receipes": [
        {
            "name": "GRILLED BASIL CHICKEN",
            "author": "saferecipeguide",
            "image": "https://spicesinc.com/images/Recipes/basilchick.jpg",
            "ingredients": [
                "¾ cup balsamic vinegar",
                "¼ cup tightly packed fresh basil leaves, orange quote icon gently rub produce under cold running water.",
                "2 tbsp olive oil",
                "1 garlic clove, minced",
                "½ tsp salt",
                "4 plum tomatoes, orange quote icon scrubbed with clean vegetable brush under running water.",
                "4 boneless skinless chicken breast halves (4 ounces each)"
            ],
            "directions": [
                "Wash hands with soap and water.",
                "After washing basil and tomatoes, blot them dry with clean paper towel.",
                "Using a clean cutting board, cut tomatoes into quarters.",
                "For marinade, place first six ingredients in a blender. Cover and process until well blended.",
                "Place chicken breasts in a shallow dish; orange quote icon do not rinse raw poultry. Cover with marinade. Cover dish. Refrigerate about 1 hour, turning occasionally. orange quote icon Wash dish after touching raw poultry.",
                "Wash hands with soap and water after handling uncooked chicken.",
                "Place chicken on an oiled grill rack over medium heat. orange quote icon Do not reuse marinades used on raw foods. Grill chicken 4-6 minutes per side. orange quote icon Cook until internal temperature reaches 165 °F as measured with a food thermometer."
            ]
        },
        {
            "name": "MISO-MARINATED SHORT RIBS",
            "author": "saferecipeguide",
            "image": "https://assets.bonappetit.com/photos/5a04d3a481ac2a5925c1c1c0/5:4/w_3459,h_2767,c_limit/miso-and-mayo-marinated-short-ribs-with-spicy-sauce.jpg",
            "ingredients": [
                "3 tbsp red or yellow miso",
                "3 tbsp mayonnaise",
                "3 tbsp (or more) unseasoned rice vinegar, divided",
                "1 ½ lbs thin cross-cut bone-in short ribs (flank-style)",
                "Kosher salt",
                "1 bunch small radishes, orange quote icon scrubbed with clean vegetable brush under running water",
                "4 tsp vegetable oil",
                "2 cups steamed rice",
                "1 bunch watercress, tough stems removed and orange quote icon gently rubbed under cold running water",
                "Sriracha or hot sauce (for serving)"
            ],
            "directions": [
                "Wash hands with soap and water. In small bowl, stir together miso, mayonnaise, and 2 tbsp vinegar. Place ribs on a rimmed baking sheet and season lightly with salt; orange quote icon do not rinse raw meat. Pour all but 2 tablespoons miso mixture over ribs; turn to coat. Set remaining miso mixture aside.",
                "Thinly slice radishes and toss in a medium bowl with remaining 1 tbsp vinegar. Season with salt and toss again.",
                "Heat a large heavy skillet, preferably cast iron, over medium-high. When pan is hot, add 2 tsp. oil and swirl to coat. Remove ribs from marinade;  orange quote icon do not reuse marinade used on raw meat.",
                "Wash hands with soap and water after handling uncooked meat. Add half of ribs to pan and cook without turning until underside is very dark brown and charred in spots, about 2 minutes. Turn ribs and cook until second side is golden brown, 1-2 minutes, and orange quote icon internal temperature reaches 145 °F on food thermometer. Transfer to a plate. Repeat with remaining 2 tsp. oil and remaining ribs. Let rest 5 minutes.",
                "Season reserved miso mixture with Sriracha; adjust to taste. Add additional vinegar, if desired. Cut ribs crosswise into 2 or 3 pieces; serve over bowls of rice, topped with watercress and drained radishes and drizzled with spicy sauce."
            ]
        },
        {
            "name": "GREEN BEANS WITH BACON AND NEW POTATOES",
            "author": "saferecipeguide",
            "image": "https://fruitsandveggies.org/wp-content/uploads/2019/02/2017-StoryDinner-SouthernBeansPotatoes-Final-558x439.jpg",
            "ingredients": [
                "4 slices bacon",
                "1 medium onion,  orange quote icon scrubbed with clean vegetable brush under running water and chopped",
                "2 lbs fresh green beans, orange quote icon gently rubbed under cold running water and snapped",
                "8 small new potatoes, orange quote icon scrubbed with clean vegetable brush under running water and cut in half",
                "1/8 tsp salt",
                "1/8 tsp pepper"
            ],
            "directions": [
                "Wash hands with soap and water. Cut bacon into thirds on clean meat cutting board.  orange quote icon Wash cutting board.",
                "Cook the bacon pieces in a large sauce pan over medium heat for 5 minutes.  orange quote icon Wash hands with soap and water after handling bacon.",
                "Add onion to sauce pan with the bacon; sauté until translucent, about 5 minutes. Add green beans and potatoes to the sauce pan with just enough water to cover.",
                "Bring to a boil, then reduce the heat to low. Add salt and pepper and cover. Simmer about 1 hour or until the beans are tender. Stir occasionally and add more water if necessary to keep the beans covered."
            ]
        },
        {
            "name": "EASY CHICKEN AND VEGETABLE STIR-FRY",
            "author": "saferecipeguide",
            "image": "https://www.momontimeout.com/wp-content/uploads/2018/11/chicken-stir-fry.jpg",
            "ingredients": [
                "1 tbls vegetable oil",
                "1 lb boneless skinless chicken breast, cut into 1-inch pieces",
                "2 garlic cloves, finely chopped",
                "2 tsps gingerroot, finely chopped",
                "1 medium onion,  orange quote icon scrubbed with clean vegetable brush under running water and cut into thin wedges",
                "1 cup baby carrots, orange quote icon scrubbed with clean vegetable brush under running and cut lengthwise in half",
                "1 cup chicken broth soup",
                "3 tbls soy sauce",
                "2 tsps sugar",
                "2 cups broccoli flowerets orange quote icon gently rubbed under cold running water",
                "1 cup (3 ounces) fresh mushrooms orange quote icon gently rubbed under cold running water and diced",
                "½ cup red bell pepper orange quote icon scrubbed with clean vegetable brush under running water and diced",
                "2 tsps cornstarch",
                "4 cups hot cooked Chinese plain noodles"
            ],
            "directions": [
                "Wash hands with soap and water. Heat vegetable oil in skillet over medium-high heat. Add chicken, garlic and gingerroot; stir-fry 2 to 3 minutes or until chicken is brown.",
                "Wash hands with soap and water after handling uncooked chicken. Wash cutting board and knife after touching raw chicken.",
                "Add onion, carrots, 3/4 cup of the broth, the soy sauce and sugar. Cover and cook over medium heat 5 minutes, stirring twice.",
                "Add broccoli, mushrooms and bell pepper. Cover and cook about 5 minutes, stirring occasionally, until chicken is no longer pink in center and orange quote icon internal temperature reaches 165 °F on food thermometer, and vegetables are crisp-tender.",
                "Mix cornstarch with remaining 1/4 cup broth; stir into chicken mixture. Cook, stirring frequently, until sauce is thickened. Serve over noodles or rice."
            ]
        },
        {
            "name": "CANTALOUPE GAZPACHO",
            "author": "saferecipeguide",
            "image": "https://assets.bonappetit.com/photos/57ae09151b334044149759a2/master/pass/cantaloupe-gazpacho-6461.jpg",
            "ingredients": [
                "1 medium cantaloupe,  orange quote icon scrubbed with clean vegetable brush under running water, peeled, seeded and chopped",
                "1 small cucumber, orange quote icon scrubbed with clean vegetable brush under running water, peeled and chopped",
                "2 tbsp chopped red onion, orange quote icon gently rubbed under cold running water",
                "2 tsps kosher salt",
                "1/3 cup water",
                "½ cup extra virgin olive oil",
                "Black pepper, for seasoning",
                "Mint, orange quote icon gently rubbed under cold running water and sliced, for topping"
            ],
            "directions": [
                "Wash hands with soap and water. In blender, puree cantaloupe, cucumber, onion, salt and water until smooth, about 1 - 2 minutes.",
                "With motor running, drizzle in olive oil. Sprinkle with freshly ground black pepper.",
                "Serve gazpacho chilled, topped with mint slices."
            ]
        }
    ]
}